[
  {
    "name": "Pikes Peak Plastics",
    "description": "A turn key website solution for client user friendliness and extensibility. Built with Wordpress 4.7 and PHP7 for performance.",
    "specs": ["Wordpress", "PHP", "jQuery", "Bootstrap", "RWD"],
    "mainImage": "assets/img/desktop_pikes-peak-plastics-engineering-web-development.jpg",
    "logo": "assets/img/logo_pikes-peak-plastics-engineering-web-design.png",
    "modalID": "pikes-peak",
    "link": "http://pikespeakplastics.com",
    "rwdImage": "assets/img/rwd_pikes-peak-plastics-web-design.png",
    "techincalSpecs": "For Pikes Peak Plastics, I knew my team and I wanted to use Wordpress for the Content Management System since the owner of the company already had prior experience with Wordpress. Utilizing Advanced Custom Fields and the Theme Customizer all written and visual content on the website was made editable from the backend along with conditional logic to add or remove features. For Frontend Behavior such as the gallery slider and css animations I chose to develop the features without a plugin to create minimalistic functionality to increase home page load times. From the design mock-ups to the website development and even the majority of the photography this website is a full represenation of my wide set of skills.",
    "review": "",
    "reviewer": "",
    "reviewPic": ""
  },
  {
    "name": "Rossi Vucinovich PC",
    "description": "A robust attorney website and blog designed to bring quality information to railroad injury victims. My first client as a freelance Web Designer and Internet Marketer. My Internet Marketing services have 'greatly increased the infrastructure of the company over the past year' - James Vucinovich, President of RVPC.",
    "specs": ["Wordpress", "PHP", "jQuery", "RWD", "SASS"],
    "mainImage": "assets/img/desktop_rossi-vucinovich-lawyer-web-development.jpg",
    "logo": "assets/img/logo_rossi-vucinovich-lawyer-web-design.png",
    "modalID": "rvpc",
    "link": "http://www.railroad-injuries.com",
    "rwdImage": "",
    "techincalSpecs": "I have worked with Rossi Vucinovich PC for almost 2 years and it has been amazing to the see transformation that my work has had on their law firm. During the two year period I have completely re-built their websites and recently developed this additional website to better market to their railroad injury clients.",
    "review": "Clean and Smart Design",
    "reviewer": "Richard Wood - Firm Administrator",
    "reviewPic": "assets/img/review_richard-wood.jpg"
  },
  {
    "name": "Torrent Software",
    "description": "A small custom internal CMS built to manage diagnostic information for an innovative health care software company.",
    "specs": ["PHP", "jQuery", "Bootstrap", "RWD", "MVC", "Object Oriented Design", "SASS", "Flight: A PHP Micro-Framework"],
    "mainImage": "assets/img/desktop_torrent-software-healthcare-web-development.jpg",
    "logo": "assets/img/logo_torrent-software-web-design.png",
    "modalID": "torrent-software",
    "link": "http://torrent-software-sandbox.madwirebuild2.com",
    "rwdImage": "",
    "techincalSpecs": "This client needed a small content management system that will allow their users to login, view their healthcare care plans based from unique diagnostic codes and print off resources related to a diagnosis. On the administartive side, the client needed functionality to manage users, run CRUD operations on diagnostic content and their related care plan phases. Initially this build was developed as a static POC and then was continuously developed over the course of 3 months. This was a great opportunity for me to prove my knowledge of application development to my team leads and further my knowledge of object oriented programming, the model view controller paradigm and relational database design.",
    "review": "Hey man just wanted to say thanks for all your hard work on this. You’re helping someone’s dream become a reality! Couldn’t have done this without your ambition and execution excellence as a developer!",
    "reviewer": "Josh Bacon (Manager at Madwire Media)",
    "reviewPic": ""
  },
  {
    "name": "Impact Canopies",
    "description": "A robust eCommerce website built with WooCommerce",
    "specs": ["eCommerce Development", "PHP", "Wordpress", "WooCommerce", "jQuery", "Bootstrap", "RWD"],
    "mainImage": "assets/img/desktop_impact-canopies-ecommerce.jpg",
    "logo": "assets/img/logo_impact.png",
    "modalID": "torrent-software",
    "link": "http://impactcanopy.com",
    "rwdImage": "",
    "techincalSpecs": "Impact Canopies was looking to simplify their website so we mitigated a lot of the frontend functionality to simpler design while still keeping the internal functionality and support for international clients, custom project management, and tailored product functionality for their vast amount of product variations. This site was built while working at Madwire Media.",
    "review": "",
    "reviewer": "",
    "reviewPic": ""
  }
]
